tutorials/incompressible/pimpleDyMFoam/movingCone/constant/polyMesh/boundary
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    movingWall
    {
        type            wall;
        nFaces          85;
        startFace       3665;
    }
    farFieldMoving
    {
        type            patch;
        nFaces          50;
        startFace       3750;
    }
    fixedWall
    {
        type            wall;
        nFaces          35;
        startFace       3800;
    }
    axis
    {
        type            symmetryPlane;
        nFaces          0;
        startFace       3835;
    }
    left
    {
        type            patch;
        nFaces          30;
        startFace       3835;
    }
    farField
    {
        type            patch;
        nFaces          35;
        startFace       3865;
    }
    back
    {
        type            wedge;
        nFaces          1900;
        startFace       3900;
    }
    front
    {
        type            wedge;
        nFaces          1900;
        startFace       5800;
    }
)

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
