tutorials/incompressible/pimpleDyMFoam/movingCone/0/U
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    movingWall      
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    farFieldMoving  
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    fixedWall       
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    axis            
    {
        type            symmetryPlane;
    }

    left            
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    farField        
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    back            
    {
        type            wedge;
    }

    front           
    {
        type            wedge;
    }
}

// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
